cmckiel/hal/simulations/stm32f446re/test/i2c_driver_test.cpp
    // Given the transaction was submitted successfully
    ASSERT_EQ(hal_i2c_submit_transaction(&txn), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_QUEUED);

    // When the servicer loads the transaction and issues START
    ASSERT_EQ(hal_i2c_transaction_servicer(), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_PROCESSING);
    ASSERT_TRUE(Sim_I2C1.CR1 & I2C_CR1_START);

    // Simulate ISR progress:

    // --------- SB phase ---------
    // HW-SIM: START condition sent -> SB set
    Sim_I2C1.SR1 |= I2C_SR1_SB;
    I2C1_EV_IRQHandler();
    // Assert address was written to data register in write mode.
    ASSERT_EQ(Sim_I2C1.DR, static_cast<uint32_t>((txn.target_addr << 1) | 0)); // write = 0

    // HW-SIM: User code reads SR1 -> HW clears SB then clears START shortly after
    Sim_I2C1.SR1 &= ~I2C_SR1_SB;
    Sim_I2C1.CR1 &= ~I2C_CR1_START;

    // --------- ADDR phase ---------
    // HW-SIM: target ACKs address -> HW sets ADDR
    Sim_I2C1.SR1 |= I2C_SR1_ADDR;
    I2C1_EV_IRQHandler();
    // Assert TXE and RXNE interrupts are enabled after successful address ack.
    ASSERT_TRUE(Sim_I2C1.CR2 & I2C_CR2_ITBUFEN);

    // HW-SIM: User code reads SR1 followed by SR2 -> HW clears ADDR
    Sim_I2C1.SR1 &= ~I2C_SR1_ADDR;

    // --------- TX phase ---------
    // Feed two TXE events. ISR should write both bytes, arming BTF after the last

    // --- TXE byte #1 ---
    // HW-SIM: Transmit buffer empty and ITBUFEN is enabled -> TXE is set
    Sim_I2C1.SR1 |= I2C_SR1_TXE;
    I2C1_EV_IRQHandler();
    // Assert the first data was written and STOP condition is not generated.
    ASSERT_EQ(Sim_I2C1.DR, static_cast<uint32_t>(0x01));
    ASSERT_FALSE(Sim_I2C1.CR1 & I2C_CR1_STOP);
    // HW-SIM: On real HW, TXE would clear on DR write then re-assert when shifter advances.
    // Here we just leave it to be re-set manually before the next ISR call.

    // --- TXE byte #2 ---
    // HW-SIM: Transmit buffer empty and ITBUFEN is enabled -> TXE is set
    Sim_I2C1.SR1 |= I2C_SR1_TXE;
    I2C1_EV_IRQHandler();
    // Assert the second data was written and STOP condition is not generated.
    ASSERT_EQ(Sim_I2C1.DR, static_cast<uint32_t>(0xAB));
    ASSERT_FALSE(Sim_I2C1.CR1 & I2C_CR1_STOP);

    // --------- BTF / STOP phase ---------
    // Finalize transmit with BTF; ISR should STOP and clear ITBUFEN for pure WRITE
    // HW-SIM: Last bit has been transmitted on the line -> BTF set.
    Sim_I2C1.SR1 |= I2C_SR1_BTF;
    I2C1_EV_IRQHandler();
    // Assert the STOP condition is set and that TXE and RXNE interrupts are disabled.
    ASSERT_TRUE(Sim_I2C1.CR1 & I2C_CR1_STOP);
    ASSERT_FALSE(Sim_I2C1.CR2 & I2C_CR2_ITBUFEN);

    // HW-SIM: HW clears BTF once a STOP condition is generated and STOP after.
    Sim_I2C1.SR1 &= ~I2C_SR1_BTF;
    Sim_I2C1.CR1 &= ~I2C_CR1_STOP;

    // --------- Assert results ---------
    // Then the next servicer call completes the transaction and copies results back
    ASSERT_EQ(hal_i2c_transaction_servicer(), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_COMPLETED);
    ASSERT_EQ(txn.transaction_result, HAL_I2C_TXN_RESULT_SUCCESS);
    ASSERT_EQ(txn.actual_bytes_transmitted, static_cast<size_t>(2));
    ASSERT_EQ(txn.actual_bytes_received, static_cast<size_t>(0));
}

TEST_F(I2CDriverTest, ISRHandlesAddressNACK)
{
    // Given an initialized I2C driver
    ASSERT_EQ(hal_i2c_init(nullptr), HAL_STATUS_OK);

    // Prepare a simple 1-byte WRITE so we can hit the address phase.
    HalI2C_Txn_t txn = {};
    txn.target_addr               = 0x2A;
    txn.i2c_op                    = HAL_I2C_OP_WRITE;
    txn.tx_data[0]                = 0xDE;
    txn.num_of_bytes_to_tx        = 1;
    txn.expected_bytes_to_rx      = 0;
    txn.processing_state          = HAL_I2C_TXN_STATE_CREATED;
    txn.transaction_result        = HAL_I2C_TXN_RESULT_NONE;
    txn.actual_bytes_received     = 0;
    txn.actual_bytes_transmitted  = 0;
    memset(txn.rx_data, 0, sizeof(txn.rx_data));

    // Given the transaction was submitted successfully
    ASSERT_EQ(hal_i2c_submit_transaction(&txn), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_QUEUED);

    // Given the servicer loads the transaction and asserts START
    ASSERT_EQ(hal_i2c_transaction_servicer(), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_PROCESSING);
    ASSERT_TRUE(Sim_I2C1.CR1 & I2C_CR1_START);

    // --------- SB phase ---------
    // HW-SIM: START condition sent -> SB set
    Sim_I2C1.SR1 |= I2C_SR1_SB;
    I2C1_EV_IRQHandler();
    // Assert address was written to data register in write mode.
    ASSERT_EQ(Sim_I2C1.DR, static_cast<uint32_t>((txn.target_addr << 1) | 0));

    // HW-SIM: HW would clear SB and then START shortly after
    Sim_I2C1.SR1 &= ~I2C_SR1_SB;
    Sim_I2C1.CR1 &= ~I2C_CR1_START;

    // --------- Address NACK error ---------
    // HW-SIM: target NACKs address -> AF set in SR1, error IRQ fires
    Sim_I2C1.SR1 |= I2C_SR1_AF;
    I2C1_ER_IRQHandler();

    // Error ISR should clear AF itself and abort:
    // - STOP requested
    // - ITBUFEN disabled
    // - transfer no longer in progress
    ASSERT_FALSE(Sim_I2C1.SR1 & I2C_SR1_AF);
    ASSERT_TRUE(Sim_I2C1.CR1 & I2C_CR1_STOP);
    ASSERT_FALSE(Sim_I2C1.CR2 & I2C_CR2_ITBUFEN);

    // Finalize: servicer should complete the transaction with FAIL
    ASSERT_EQ(hal_i2c_transaction_servicer(), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_COMPLETED);
    ASSERT_EQ(txn.transaction_result, HAL_I2C_TXN_RESULT_FAIL);
    ASSERT_EQ(txn.actual_bytes_transmitted, static_cast<size_t>(0));
    ASSERT_EQ(txn.actual_bytes_received,   static_cast<size_t>(0));
}

TEST_F(I2CDriverTest, ISRHandlesBasicRead4Bytes)
{
    // Representing the I2C peripheral's internal shift register.
    uint32_t shift_register = 0;

    // Given an initialized I2C driver
    ASSERT_EQ(hal_i2c_init(nullptr), HAL_STATUS_OK);

    // Given a simple READ transaction of 4 bytes
    HalI2C_Txn_t txn = {};
    txn.target_addr               = 0xDD;
    txn.i2c_op                    = HAL_I2C_OP_READ;
    txn.num_of_bytes_to_tx        = 0;
    txn.expected_bytes_to_rx      = 4;
    txn.processing_state          = HAL_I2C_TXN_STATE_CREATED;
    txn.transaction_result        = HAL_I2C_TXN_RESULT_NONE;
    txn.actual_bytes_received     = 0;
    txn.actual_bytes_transmitted  = 0;
    memset(txn.rx_data, 0, sizeof(txn.rx_data));

