cmckiel/hal/simulations/stm32f446re/test/i2c_driver_test.cpp
    // Given the transaction was submitted successfully
    ASSERT_EQ(hal_i2c_submit_transaction(&txn), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_QUEUED);

    // When the servicer loads the transaction and issues START
    ASSERT_EQ(hal_i2c_transaction_servicer(), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_PROCESSING);
    ASSERT_TRUE(Sim_I2C1.CR1 & I2C_CR1_START);

    // Simulate ISR progress:

    // --------- SB phase ---------
    // HW-SIM: START condition sent -> SB set
    Sim_I2C1.SR1 |= I2C_SR1_SB;
    I2C1_EV_IRQHandler();
    // Assert address was written to data register in read mode.
    ASSERT_EQ(Sim_I2C1.DR, static_cast<uint32_t>((txn.target_addr << 1) | 1)); // read = 1

    // HW-SIM: User code reads SR1 -> HW clears SB then clears START shortly after
    Sim_I2C1.SR1 &= ~I2C_SR1_SB;
    Sim_I2C1.CR1 &= ~I2C_CR1_START;

    // --------- ADDR phase ---------
    // HW-SIM: target ACKs address -> HW sets ADDR
    Sim_I2C1.SR1 |= I2C_SR1_ADDR;
    I2C1_EV_IRQHandler();
    // Assert ACK is set for multi-byte read and that RxNE and TxE interrupts are
    // disabled.
    ASSERT_TRUE(Sim_I2C1.CR1 & I2C_CR1_ACK);
    ASSERT_FALSE(Sim_I2C1.CR2 & I2C_CR2_ITBUFEN);

    // HW-SIM: User code reads SR1 followed by SR2 -> HW clears ADDR
    Sim_I2C1.SR1 &= ~I2C_SR1_ADDR;

    // --------- RX phase ---------
    // We will deliver four data bytes: 0xA9, 0xB8, 0xC7, 0xD6

    // --- Byte #1 ---
    // HW-SIM: First byte received -> RXNE set but no iterrupt since
    // RxNE interrupts are not enabled.
    Sim_I2C1.DR  = static_cast<uint32_t>(0xA9);
    Sim_I2C1.SR1 |= I2C_SR1_RXNE;

    // --- Byte #2 ---
    // HW-SIM: Next byte has arrived -> BTF set,
    // DR contains 0xA9, Shift Register contains 0xB8.
    // Interrupt is generated by BTF.
    shift_register = static_cast<uint32_t>(0xB8);
    Sim_I2C1.SR1 |= I2C_SR1_BTF;
    I2C1_EV_IRQHandler();

    // HW-SIM: Hardware clears BTF and RXNE after 0xA9 is read from DR and
    // moves 0xB8 from shift register to DR.
    Sim_I2C1.SR1 &= ~I2C_SR1_BTF;
    Sim_I2C1.SR1 &= ~I2C_SR1_RXNE;
    Sim_I2C1.DR  = shift_register;
    Sim_I2C1.SR1 |= I2C_SR1_RXNE; // moving data into DR from shift register sets RxNE.

    // --- Byte #3 ---
    // HW-SIM: Next byte has arrived -> BTF set,
    // DR contains 0xB8, Shift Register contains 0xC7.
    // Interrupt is generated by BTF.
    shift_register = static_cast<uint32_t>(0xC7);
    Sim_I2C1.SR1 |= I2C_SR1_BTF;
    I2C1_EV_IRQHandler();
    // Driver should clear ACK to NACK the last byte
    ASSERT_FALSE(Sim_I2C1.CR1 & I2C_CR1_ACK);

    // HW-SIM: Hardware clears BTF and RXNE after 0XB8 is read from DR and
    // moves 0xC7 from shift register to DR.
    Sim_I2C1.SR1 &= ~I2C_SR1_BTF;
    Sim_I2C1.SR1 &= ~I2C_SR1_RXNE;
    Sim_I2C1.DR  = shift_register;
    // Sim_I2C1.SR1 |= I2C_SR1_RXNE; // moving data into DR from shift register sets RxNE.
                                     // HW-SIM: Truthfully, the hardware sets this. But under test, I cannot
                                     // because the logic relies on hardware clearing this the moment DR is read, right in
                                     // the middle of the interrupt. I cannot simulate that in this single thread
                                     // of execution. RxNE therefore would stay set even after a DR read during this
                                     // test, which would invalidate the logic, and isn't how the hardware actually works.

    // --- Byte #4 arrives ---
    // HW-SIM: 0xD6 arrived in shift register.
    // DR contains 0xC7, shift register contains 0xD6.
    // Both RxNE and BTF set. Interrupt generated by BTF.
    shift_register = static_cast<uint32_t>(0xD6);
    Sim_I2C1.SR1 |= I2C_SR1_BTF;
    I2C1_EV_IRQHandler();
    // Assert STOP condition generated since all bytes have
    // been received.
    ASSERT_TRUE(Sim_I2C1.CR1 & I2C_CR1_STOP);
    // Assert RxNE interrupt is enabled so ISR can pick up the last
    // byte once it moves from shift register to DR.
    ASSERT_TRUE(Sim_I2C1.CR2 & I2C_CR2_ITBUFEN);

    // HW-SIM: HW clears BTF and RxNE after reading 0xC7 from DR and moves 0xD6 into DR.
    Sim_I2C1.SR1 &= ~I2C_SR1_BTF;
    Sim_I2C1.SR1 &= ~I2C_SR1_RXNE;
    Sim_I2C1.DR  = shift_register;
    // HW-SIM: HW clears STOP after it is generated.
    Sim_I2C1.CR1 &= ~I2C_CR1_STOP;

    // --- Byte #4 gets read ---
    // After 0xD6 gets moved from shift register to DR, RxNE interrupt is generated.
    Sim_I2C1.SR1 |= I2C_SR1_RXNE;
    I2C1_EV_IRQHandler();

    // Assert buffer IRQs should be disabled.
    ASSERT_FALSE(Sim_I2C1.CR2 & I2C_CR2_ITBUFEN);

    // --------- Assert results ---------
    // Then the next servicer call completes the transaction and copies results back
    ASSERT_EQ(hal_i2c_transaction_servicer(), HAL_STATUS_OK);
    ASSERT_EQ(txn.processing_state, HAL_I2C_TXN_STATE_COMPLETED);
    ASSERT_EQ(txn.transaction_result, HAL_I2C_TXN_RESULT_SUCCESS);
    ASSERT_EQ(txn.actual_bytes_transmitted, static_cast<size_t>(0));
    ASSERT_EQ(txn.actual_bytes_received,   static_cast<size_t>(4));
    ASSERT_EQ(txn.rx_data[0], static_cast<uint8_t>(0xA9));
    ASSERT_EQ(txn.rx_data[1], static_cast<uint8_t>(0xB8));
    ASSERT_EQ(txn.rx_data[2], static_cast<uint8_t>(0xC7));
    ASSERT_EQ(txn.rx_data[3], static_cast<uint8_t>(0xD6));
}

TEST_F(I2CDriverTest, ISRHandlesBasicRead3Bytes)
{
    // Representing the I2C peripheral's internal shift register.
    uint32_t shift_register = 0;

    // Given an initialized I2C driver
    ASSERT_EQ(hal_i2c_init(nullptr), HAL_STATUS_OK);

    // Given a simple READ transaction of 3 bytes
    HalI2C_Txn_t txn = {};
    txn.target_addr               = 0x3C;
    txn.i2c_op                    = HAL_I2C_OP_READ;
    txn.num_of_bytes_to_tx        = 0;
    txn.expected_bytes_to_rx      = 3;
    txn.processing_state          = HAL_I2C_TXN_STATE_CREATED;
    txn.transaction_result        = HAL_I2C_TXN_RESULT_NONE;
    txn.actual_bytes_received     = 0;
    txn.actual_bytes_transmitted  = 0;
    memset(txn.rx_data, 0, sizeof(txn.rx_data));

